# Pandas
ref: code with harry

In [5]:
import numpy as np
import pandas as pd

In [6]:
dict1 = {
    "name":['harsh','hani','harshit'],
    "marks":[100,58,91],
    "city":['Rampur','kolkata','dholpur']
}

In [7]:
df = pd.DataFrame(dict1)
df

      name  marks     city
0    harsh    100   Rampur
1     hani     58  kolkata
2  harshit     91  dholpur

In [8]:
df.to_csv('Learning_pandas.csv')

In [9]:
df.to_csv('Learning_pandas_IndexFalse.csv', index = False)

In [12]:
df.head(2) #first two data
df.tail(2) #last two data

    name  marks     city
0  harsh    100   Rampur
1   hani     58  kolkata

In [14]:
df.describe()

            marks
count    3.000000
mean    83.000000
std     22.113344
min     58.000000
25%     74.500000
50%     91.000000
75%     95.500000
max    100.000000